Featured of Columns

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('titanic.csv')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.25,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,NaN,1.0,0.0,NaN,C,First,NaN,False,C,NaN,yes,False
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.10,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0.0,0.0,8.05,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,2.0,male,27.0,0.0,0.0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1.0,1.0,female,19.0,0.0,0.0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0.0,3.0,female,NaN,1.0,2.0,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1.0,1.0,male,26.0,0.0,0.0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0.0,3.0,male,32.0,0.0,0.0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

Show Data Fream from top with mentioned number of value

In [6]:
df.head(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,NaN,1.0,0.0,NaN,C,First,NaN,False,C,NaN,yes,False
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0.0,0.0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.0,3.0,male,NaN,0.0,0.0,8.0500,S,Third,man,True,NaN,Southampton,no,True
96,0.0,1.0,male,71.0,0.0,0.0,34.6542,C,First,man,True,A,Cherbourg,no,True
97,1.0,1.0,male,23.0,0.0,1.0,63.3583,C,First,man,True,D,Cherbourg,yes,False
98,1.0,2.0,female,34.0,0.0,1.0,23.0000,S,Second,woman,False,NaN,Southampton,yes,False
99,0.0,2.0,male,34.0,1.0,0.0,26.0000,S,Second,man,True,NaN,Southampton,no,False

Show Data Fream from bottom with mentioned number of value

In [8]:
df.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
881,0.0,3.0,male,33.0,0.0,0.0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0.0,3.0,female,22.0,0.0,0.0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0.0,2.0,male,28.0,0.0,0.0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0.0,3.0,male,25.0,0.0,0.0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0.0,3.0,female,39.0,0.0,5.0,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0.0,2.0,male,27.0,0.0,0.0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1.0,1.0,female,19.0,0.0,0.0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0.0,3.0,female,NaN,1.0,2.0,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1.0,1.0,male,26.0,0.0,0.0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0.0,3.0,male,32.0,0.0,0.0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Show Column Name, Data Type and Number of  non-null Records in a Data Fream

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     890 non-null    float64
 1   pclass       890 non-null    float64
 2   sex          890 non-null    object
 3   age          712 non-null    float64
 4   sibsp        890 non-null    float64
 5   parch        890 non-null    float64
 6   fare         889 non-null    float64
 7   embarked     888 non-null    object
 8   class        890 non-null    object
 9   who          889 non-null    object
 10  adult_male   890 non-null    object
 11  deck         203 non-null    object
 12  embark_town  887 non-null    object
 13  alive        890 non-null    object
 14  alone        890 non-null    object
dtypes: float64(6), object(9)
memory usage: 104.5+ KB

Show Number of Row and Columns in a Data Fream

In [12]:
df.shape

(891, 15)

Show, is there any duplicate or repeted value in the data fream ?

In [15]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

Show, number of duplicate or repeted value in the data fream

In [17]:
df.duplicated().sum()

107

Show Number of Unique value in the columns of a data fream

In [20]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           247
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

Show All Columns Name in the Data Fream

In [22]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

Show How many columns in the Data Fream

In [24]:
print(len(df.columns))

15

Show the Name of Entities in the Column

In [28]:
df['embark_town'].unique()

array(['Southampton', nan, 'Queenstown', 'Cherbourg'], dtype=object)

Show the Number of Entities in the Column

In [31]:
df['embark_town'].nunique()

3

Show How many number of each Entity in the column

In [33]:
df['embark_town'].value_counts()

embark_town
Southampton    643
Cherbourg      167
Queenstown      77
Name: count, dtype: int64

Show all kind of Data Type in the Dataset

In [37]:
df.dtypes

survived       float64
pclass         float64
sex             object
age            float64
sibsp          float64
parch          float64
fare           float64
embarked        object
class           object
who             object
adult_male      object
deck            object
embark_town     object
alive           object
alone           object
dtype: object

Show is there any Null Field in the Dataset

In [40]:
df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,True,False,False,True,False,False,True,False,False,True,False,False
2,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

Show Column wise all null values in the Dataset

In [42]:
df.isnull().sum()

survived         1
pclass           1
sex              1
age            179
sibsp            1
parch            1
fare             2
embarked         3
class            1
who              2
adult_male       1
deck           688
embark_town      4
alive            1
alone            1
dtype: int64

Show Total number of Null Values in the Dataset

In [44]:
df.isnull().sum().sum()

887